Repository: rszemeti/LiveBidderPLugin
Catalog: backend-frontend-template/languages/bft-internationalization-*.po
Languages: es

source: field where it's stored the row name (the name of a user, the name of a book, etc.)
es: campo donde se guarda el nombre de la fila (el nombre de un usuario, el nombre de un libro, etc.)

source: foreign key on the internationalization table
es: clave foránea de la tabla de internalización

source: list of fields
es: lista de campos

source: Optional field parameters
es: Parámetro opcional de los campos

source: text to show on the admin
es: texto a mostrar en la administración

source: Default
es: Por defecto

source: placeholder if the data type can have placeholder
es: placeholder si el tipo de dato puede tener placeholder

source: display the field on the list table
es: muestra el campo en la tabla-lista

source: display_table doesn't work for now with many_to_many_relationship fields
es: display_table no funciona por ahora con campos many_to_many_relationship

source: if the data of the field is stored in a internationalization table
es: si los datos del campo están almacenados en una tabla de internalización

source: display the field only if the data is active
es: muestra el campo sólo si lso datos están activos

source: display the field only if the data is on the bin
es: muestra el campo sólo si los datos están la papelera

source: readonly field, for the column key for example
es: campo de sólo lectura, para la columna clave por ejemplo

source: catch the data from the GET data on the URL if there aren't data stored of this field. For a dependant data, example: teachers' notes, a new note needs to know the teacher id of the note
es: coge el dato de los datos GET en la URL si no hay dato guardado de este campo. Para datos dependientes, ejemplo: notas de profesores, una nueva nota necesita saber el id del profesor de la nota

source: a empty data will be transformed to NULL (the NULL data always is printed like value='')
es: un dato vacío se transformará a NULL (el dato NULL siempre se mostrará como value='')

source: it stores a foreign key
es: guarda una clave foránea

source: text to show when NULL is stored in a foreign key with optional NULL
es: texto para mostrar cuando NULL es guardado en una clave foránea con NULL opcional

source: the input options of BFT plus the option
es: las opciones de inputs de BFT y además la opción

source: it's a select for link the relationship
es: es un select para enlazar la relación

source: Default 'text'
es: 'text' por defecto

source: uses the data stored in
es: usa los datos guardados en

source: input textarea, rows and cols are optionals
es: input textarea, rows y cols son opcionales

source: input number, optional args: min, max and step. Default of step: 1, alternative: 'decimal' or 'decimals', this option calculate the needed steps
es: input number, args opcionales: min, max y step. Por defecto en step: 1, alternativo: 'decimal' o 'decimals', esta opción calculate los steps necesarios

source: input select, args must have 'options', it stores string wiht checked options, ej: 'en,es' , optional args: search (default false), multiple (default false)
es: input select, args tiene que tener 'options', guarda una cadena con las opciones seleccionadas, ej: 'en,es', args opcionales: search (false por defecto), multiple (false por defecto)

source: input text with a calendar, the date will be in MySQL style '2023-01-01'
es: input text con un calendario, la fecha será en estilo MySQL '2023-01-01'

source: single and multiple, in multiple is needed 'options' on args
es: single y multiple, en multiple es necesario 'options' en args

source: radio buttons, stores string wiht checked options, ej: 'en,es', it requieres 'options'
es: radio buttons, guarda cadena con las opciones seleccionadas, ej: 'en, es', requiere 'options'

source: store is needed and select and image of the WordPress Media Library, the data saved is the ID of the file. One selected shows the image
es: guarda si es necesario y selecciona una imagen de la Biblioteca de Medios de WordPress, el dato guardado es el ID del archivo. Una vez seleccionado muestra la imagen

source: the same as the image type but don't try to display an image, only shows a download button
es: igual que con la el tipo imagen, pero no intenta mostrar una imagen, sólo muestra un botón de descarga

source: a commented input, it prints
es: un input comentado, imprime

source: This form describes a many to many relationship between two tables
es: Este formulario describe una relación mucho a mucho entre dos tablas

source: internal id of the many to many relationship
es: id interno de la relación mucho a mucho

source: array of the two relationship form
es: array de los dos formulario de la relación

source: Parametters of the two related fields
es: Parámetro de los dos campos relacionados

source: form id
es: id del formulario

source: foreign key used on the table
es: clave foránea usado en la tabla

source: Example of the array
es: Ejemplo del array

source: The system will works with the above data
es: El sistema funcionará con los datos de arriba

source: BFT needs to know what function and function_load to use on the page. The system needs to know how to read the GET data from the URL too
es: BFT necesita saber qué function y function_load usar en la página. El sistema también necesita saber cómo leer los datos GET de la URL

source: There are listing pages and form pages. It's posible to nest listing pages that use the data of the previous form, per example: notes of a theacher, first select a teacher (or create a new one), then you go to the notes of that teacher
es: Hay páginas de listados y páginas de formularios. Es posible anidar páginas de listas para usar los datos del formulario anterior, por ejemplo: notas del profesor, primero selecciona un profesor (o crea uno nuevo), entonces vas a las notas de ese profesor

source: The explanation of
es: La explicación de

source: is on the 'Menu' tag, there is a complex example of use
es: está en la pestaña 'Menu', allí hay un ejemplo completo de uso

source: Display a listing
es: Mostrar un listado

source: For display a list it's needed a child with all the data, plus it's needed
es: Para mostrar un listado es necesario un hijo con todos los datos, además se necesita

source: Display a form
es: Mostrar un formulario

source: A form normally is a children page of a list, the form needs
es: Un formulario norlmamente es una página hija de un listado, el formulario necesita

source: An exmaple of a listing and a form
es: Un ejemplo de un listado y un formulario

source: Nest a form
es: Anidar un formulario

source: To nest a BFT form it's needed always to specify the external GET data, don't put 'id' in the foreig id
es: Para anidar un formulario BFT se necesita especifiar siempre el dato GET ajeno, no pongas 'id' en el id ajeno

source: is the same as the parent form
es: es igual que el formulario padre

source: optional, works with ids_aux_required
es: opcional, funciona con ids_aux_required

source: optional
es: opcional

source: The main difference is that it has two ids: the main id, and the foreig id. Don't put 'id' in the foreig id. Plus it can show
es: La diferencia principal es que tiene dos ids: el id principal y el id foráneo. No poner 'id' en el id foráneo. Además puede mostrar

source: An example of a nested form
es: Un ejemplo de formulario anidado

source: Complex example of nested forms
es: Ejemplo complejo de formularios anidados

source: WPTP installs this example tables
es: BFT instala estas tablas de ejemplo

source: This is a part of the menu used on the BFT default menu
es: Esto es parte del menú usado en el menú por defecto de BFT

source: That generates this menu:
es: Esto genera este menú:

source: GET data
es: Datos GET

source: The folder
es: La carpeta

source: is a private folder thanks to his
es: es una carpeta privada gracias a su

source: Therefore a simple link will not work
es: Por lo tanto un simple link no funcionará

source: But a BFT download it works
es: Pero una descarga BFT funciona

source: For download it's needed a page where to send the data, this page uses the
es: Para la descarga es necesario una página donde enviar los datos, esta página usa la

source: Plus note that
es: Además nota que

source: search the 'file' get data on the URL
es: busca el dato get 'file' en la URL

source: that's why it's needed to filter the URL calls without 'file' data
es: por eso es necesario filtrar las llamadas URLs sin dato 'file'

source: Remember
es: Recuerda

source: The menu don't show a tab with GET data missing
es: El menú no muestra una pestaña con datos GET no encontrados

source: WordPress admin menu can't filter a existing page, don't use it on a parent page
es: El menú administarción de WordPress no puede filtrar una página existente, no usarlo en una página padre

source: For this example it's used this download page
es: Para este ejemplo se utiliza esta página de descarga

source: BFT Pro install this database for testing purposes
es: BFT Pro instala esta base de datos para fines de prueba

source: Notes about the database
es: Notas sobre la base de datos

source: Courses has a internationalization table
es: Cursos tiene una tabla de internalización

source: Courses and students have a many to many relationship
es: Cursos y estudiantes tienen una relación muchos a muchos

source: Courses has a soft foreig key, teacher_id can be NULL, a course can exists without a teacher
es: Cursos tiene una clave foránea suave, teacher_id puede ser NULL, un curso puede existir sin un profesor

source: Teachers' notes has a hard foreig key, teacher_id can't be NULL, a note it can't exist without a teacher
es: Notas de los profesores tiene una clave foránea dura, teacher_id no puede ser NULL, una nota no puede existir sin un profesor

source: Querys used for install the database
es: Consultas usadas para instalar la base de datos

source: Hello World
es: Hola Mundo

source: this is an iframe
es: esto es un iframe

source: There are two types of iframes, both use the page
es: Hay dos tipos de iframes, ambos usan la página

source: but you can make your own page
es: pero puedes hacer tu propia página

source: There are two types of iframes
es: Hay dos tipos de iframes

source: This method needs two pages: one is the main page with the iframe, the other is the iframe itself
es: Este método necesita dos páginas: una es la página principal con el iframe, the other is the iframe itself

source: Main page
es: Página principal

source: The main page especifies the slug of the iframe page with
es: La página principal especifica el slug de la página iframe con

source: and the display iframe page with
es: y la página que muestra el iframe con

source: Iframe page
es: Página iframe

source: The iframe page will call a function_load with a die, a function load executes before displaying the WordPress Admin Menu
es: La página iframe llamará a una function_load con un die, una function_load se ejecuta antes de mostrar el Menú de Administración de Wordpress

source: With
es: Con

source: we ignore the page on the BFT tabs menu
es: ignoramos la página on el menú de pestaña de BFT

source: Iframe by URL
es: Iframe por URL

source: This method only needs the iframe url
es: Este método sólo necesita el URL del iframe

source: and the display iframe page
es: y la página que muestra el iframe

source: points to the WordPress Admin Menu, it's used on this example because normally an external iframe will not work
es: apunta al Menú de Administración de Wordpress, es usado en este ejemplo porque normalmente un iframe externo no funcionará

source: Display PDF on ifame
es: Mostrar PDF en un iframe

source: With all this we can show a private PDF via slug iframe with
es: Con todo esto podemos mostrar un PDF privado a través de un iframe por slug con

source: We control the install, deinstall, and upgrade of the database with
es: Controlamos la instalación, desinstalación y actualización de la base de datos con

source: The
es: El

source: function
es: función

source: is launched when the plugin is installed, here we define whether to start the plugin installation database and whether to set up a cronjob
es: se lanza cuando el plugin es instalado, aquí definimos tanto empezar la instalación de la base de datos del plugin como programar un cronjob

source: is launched when the plugin is deactivated, here we stop the cronjobs and we delete the plugin database is needed
es: se lanza cuando el plugin es desactivado, aquí paramos los cronjobs y borramos la base de datos del plugin si es necesario

source: Here we have all the install, deinstall and upgrade code
es: Aquí tenemos todo el código de instalación, desinstalación y actualización

source: We install and upgrade inside of the same function
es: Instalamos y actualizamos dentro de la misma función

source: The function uses the internal option
es: La función usa la opción interna

source: or check if it's needed upgrade all, part or nothing of the database
es: o comprueba si se necesita actualizar todo, parte o nada de la base de datos

source: Here we put all the cronjobs
es: Aquí ponemos los cronjobs

source: But remenber
es: Pero recuerda

source: the system use WordPress Cronjobs, they are not real cronjobs
es: el sistema usa los Cronjobs de WordPress, no son cronjobs reales

source: WordPress check all pending cronjobs when a page is loaded, then the cronjobs do not run exactly when scheduled unlike a Unix cronjob
es: WordPress comprueba todos los cronjobs pendientes cuando se carga una página, por lo tanto los cronjobs no se ejecutan exactamente cuando están programados a diferencia de un cronjob de Unix

source: This function is launched every time the plugin class is instantiated
es: Esta función se llama cada vez que la clase del plugin es instanciada

source: It launchs
es: Lanza

source: and update the database if needed
es: y acutaliza la base de datos si es necesario

source: A menu for install and deinstall the database
es: Un menú para instalar o desinstalar la base dedatos

source: If a plugin needs retain the data: we comment the deinstall on
es: Si un plugin necesita retener los datos: comentamos la desinstalación en

source: to ensure the data is not deleted
es: para asegurar que los datos no son eliminados

source: But then it's needed a system for delete the plugin tables if the user don't want the plugin installed
es: Pero entonces es necesario un sistema para borrar las tablas del plugin si el usuario no quiere el plugin instalado

source: There is an example on
es: Hay un ejemplo en

source: INSTALL example data of Backend Frontend Template
es: INSTALAR datos de ejmplo de Backend Frontend Template

source: Example data is uninstalled, install the BFT database
es: Datos de ejemplo no instalados, instalar la base de datos de BFT

source: Prepare the example database
es: Prepara la base de datos de ejemplo

source: DELETE all the data of Backend Frontend Template
es: ELIMINA todos los datos de Backend Frontend Template

source: Unistall the plugin erase the data too
es: Desinstalar el plugin elimina también los datos

source: Copy the security text on the box
es: Copia el texto de seguridad en la caja

source: Erase all the WordPress Template Plugin data
es: Elimina todo los datos de Backend Frontend Template

source: Preparing the text
es: Preparando el texto

source: translation domain/plugin id
es: dominio de traducción/plugin id

source: for direct translation and display the translated text
es: para traducción directa y mostrar el texto traducido

source: for translation, escape the HTML characters and display the resulting text
es: para traducción, escapar los carácteres HTML y mostrar el texto resultante

source: With that, WordPress will use a translation file if it exists and has that sentence, or a external plugin will be able to translate your plugin into the visitor language
es: Con eso, WordPress usará el archivo de traducción si existe y tiene la frase, o un plugin externo será capaz de traducir tu plugin al idioma del visitante

source: BFT also provides the option of use its intermediary functions to avoid having to put the domain in every string prepared for a future translation
es: BFT además ofrece la opción de use sus funciones intermediarias para evitar tener que poner el dominio en cada cadena preparada para una futura traducción

source: With ALL the WordPress translation functions
es: Con TODAS las función de traducción de WordPress

source: For that, call the function through
es: Para eso, llama la función a través de

source: and don't put the translation domain
es: y no pontas el dominio de traducción

source: the functions allow the domain field, if you put a domain then that domain will be use
es: las funciones admiten el campo dominio, si pones un dominio se usará ese dominio

source: Preparing the translation files
es: Preparando los archivos de traducción

source: The translation files are allocated in
es: Los archivos de traducción se alojan en

source: Steps for translating a plugin
es: Parar para traducir el plugin

source: Create a new .pot file of your plugin
es: Crea un nuevo archivo .pot de tu plugin

source: Update/merge the original .pot with the new .pot file
es: Actualiza/combina el .pot original con el nuevo archivo .pot

source: Delete the old .pot files and rename the new merged file if needed
es: Borra los archivos .pot antiguos y renombra el archivo combinado si es necesario

source: Prepare the .po language file
es: Prepara el archivo de idioma .po

source: If it's a new translation language: duplicate the .pot file and change the name and extension to the designed language, like
es: Si es una nueva traducción de idioma: duplica el archivo .pot y cambia el nombre y la extensión al idioma seleccionado, como

source: If it's a existing translation language: update/merge the file with the new .pot file
es: Si es una traducción de idioma existente: actualiza/combina el archivo con el nuevo archivo .pot

source: Translate the sentences of the .po file
es: Traduce las frases del archivo .po

source: Create the .mo file from the .po file
es: Crea el archivo .mo desde el archivo .po

source: To create and merge the files and translate the sentences you can use programs such as
es: Para crear y combinar los archivos y traducir las oraciones se pueden usar programas como

source: A manual form is possible by pointing the page to a custom function for show the form and a custom function_load for store the changes on the form
es: Un formulario manual es posible gracias a apuntar la página a una function personalizada para mostrar el formulario y a una function_load personalizada para guardar los cambios del formulario

source: You can use the page
es: Puedes usar la página

source: to display the form or create your own page
es: para mostrar el formulario o crear tu propia página

source: Custom function
es: function personalizada

source: Get the data your own way and send it to the function
es: Recupera los datos como quieras y envíalos a la función

source: per example
es: por ejemplo

source: If the page uses
es: Si la página usa

source: the data will be formed in this way
es: los datos se formarán de esta manera

source: Custom function_load
es: function_load personalizada

source: This function is executed first, POST data sent from the browser or not, break the function if post data not sent or some error was found, example
es: Esta función se ejecuta primero, se envíen datos POST por el navegador o no, parar la función si no se han enviado datos POST o se encuentra algún error, ejemplo

source: At the end of the function use redirect if needed. For redirect it can be used
es: Al final de la función usa redirección si es necsario. Para redireccionar puede usarse

source: This function of WordPress needs the full URL, that's why BFT provides better alternatives
es: Esta función de WordPress necesita la URL completa, por eso BFT ofrece mejores alternativas

source: Return the actual display page without additional GET data, only the page GET data
es: Devuelve la página mostrada actualmente sin datos GET adicionales, sólo el dato GET de la página

source: Returns the GET data needed for the form of the page. Ej: if a page uses the form 'courses', send it the id '1' and it will retrieve
es: Devuelve los datos GET necesarios para el formulario de la página. Ej: si una página usa el formulario 'courses', envíale el id '1' y devolverá

source: This BFT function does a redirect to the full URL with the ID needed for the form and adds
es: Esta función BFT hace una redirección a la URL compelta con el ID necesario para el formulario y añade

source: depending on whether ID has been provided
es: dependiendo en si se le ha pasado ID

source: Full example
es: Ejemplo completo

source: A direct listing by array is possible by sending all the needed data to
es: Un listado directo por array es posible enviando todos los datos necsearios a

source: It's also necessary to use
es: También es necesario usar

source: Array data
es: Datos array

source: Required data
es: Datos requeridos

source: Array with each row of data, without id. Within each row, each column of data has the column keys
es: Array con cada fila de datos, sin id. Dentro de cada fila, cada columna de datos tiene la clave de la columna

source: Array with the keys and names of the columns
es: Array con las claves y nombres de las columnas

source: Optional data
es: Datos opcionales

source: Add or not add a link
es: Añadir o no añadir un enlace

source: the column key for the link, false if no link is needed
es: la columna clave para el enlace, false si no es necesario un link

source: the slug page
es: el slug de la página

source: Array with data to add on the GET data of the links
es: Array con data a añadir en los datos GET de los links

source: The items for a page, for data not paginated it's not needed this data
es: Los items para una página, para datos no paginados no es necesario este dato

source: The key column
es: La columna clave

source: Total items count, for data not paginated it's not needed this data
es: Recuento total de elementos, para datos no paginados no es necesario este dato

source: Total items count with the search, for data without search it's not needed this data
es: Recuento total de elementos con la búsqueda, para datos sin búsqueda no es necesario este dato

source: The search label, for data without search it's not needed this data
es: El label de búsqueda, para datos sin búsqueda no es necesario este dato

source: The actual slug page
es: El slug de la página actual

source: Ids used on this page
es: Ids usados en esta página

source: Sending the data
es: Enviando los datos

source: For display a table the function
es: Para mostrar una tabla la función

source: needs
es: necesita

source: with the listing data
es: con los datos del listado

source: A full example of a custom listing by array data used in a function
es: Un ejemplo completo de listado personalizado por datos array usado en una función

source: A paginated listing by query is possible by pointing the page to a custom function, and use inside the function
es: Un listado paginado por consulta es posible gracias a apuntar la página a una función personalizada, y usar dentro de la función

source: and finally display the page with
es: y finalmente mostrar la página con

source: It's also necessary to use the file
es: También es necsario usar el archivo

source: SELECT part of the query, without the SELECT tag
es: Parte SELECT de la consulta, sin la etiqueta SELECT

source: FROM part of the query, without the FROM tag
es: Parte FROM de la consulta, sin la etiqueta FROM

source: WHERE part of the query, without the WHERE tag
es: Parte WHERE de la consulta, sin ls etiqueta WHERE
