Repository: rszemeti/LiveBidderPLugin
Catalog: backend-frontend-template/languages/bft-internationalization-*.po
Languages: es

source: Save Settings
es: Guardar Ajustes

source: Status
es: Estado

source: Active
es: Activo

source: Bin
es: Papelera

source: Creation date
es: Fecha de creación

source: Last modification date
es: Fecha de la última modificación

source: Last elimination date
es: Fecha de eliminación

source: page
es: página

source: section
es: sección

source: What's BFT Pro
es: Qué es BFT Pro

source: What is Backend Frontend Template Pro?
es: ¿Qué es Backend Frontend Template Pro?

source: Credits
es: Créditos

source: First steps
es: Primeros pasos

source: First steps with BFT Pro
es: Primeros pasos con BFT Pro

source: Menu
es: Menú

source: The pro menu system
es: El sistema de menú pro

source: Settings
es: Ajustes

source: Settings explanation
es: Explicación de los ajustes

source: The settings/data system stored via WP
es: Sistema de ajustes/datos almacenados a través de WP

source: General settings
es: Ajustes generales

source: Changing the WordPress-plugin settings, settings id: general
es: Cambiando los ajustes, settings id: general

source: Input types test
es: Prueba de tipos de inputs

source: Database
es: Base de datos

source: Backend Frontend Template - create plugins for WordPress in no time
es: Backend Frontend Template - crea plugins para WordPress en un momentoe

source: BFT is a plugin, template and library for develop WordPress plugins easily and quickly. Save time, do more
es: BFT es un plugin, plantilla y librería para desarrollar plugins de WordPress de forma fácil y rápida. Ahorra tiempo, haz más

source: Create an advanced plugin quickly and easily. BFT is not only a template, it's also a library for WordPress plugin developers
es: Crea un plugin avanzado de forma fácil y rápida. BFT no es sólo una plantilla, es también una librería para desarrolladores de plugins de WordPress

source: Backend Frontend Template Pro - create plugins for WordPress in no time
es: Backend Frontend Template Pro - crea plugins para WordPress en un momentoe

source: BFT Pro is a plugin, template and library for develop WordPress plugins easily and quickly. Save time, do more
es: BFT Pro es un plugin, plantilla y librería para desarrollar plugins de WordPress de forma fácil y rápida. Ahorra tiempo, haz más

source: Create an advanced plugin quickly and easily. BFT Pro is not only a template, it's also a library for WordPress plugin developers
es: Crea un plugin avanzado de forma fácil y rápida. BFT Pro no es sólo una plantilla, es también una librería para desarrolladores de plugins de WordPress

source: Example database
es: Ejemplo de la base de datos

source: BFT installed database for testing purposes
es: Base de datos instalada de BFT para fines de prueba

source: (De)install database explanation
es: Explicación de instalación/desinstalación

source: Install, deinstall, upgrade database system
es: Sistema de instalación, desinstalación y actualización de la base de datos

source: (De)install menu
es: Menú de instalación/desinstalación

source: Install - deinstall data
es: Instalar - desinstalar los datos

source: Automated data manipulation
es: Manipulación de datos automatizada

source: Database managed by BFT
es: Base de datos controlada por BFT

source: Courses
es: Cursos

source: List of courses
es: Lista de cursos

source: Course
es: Curso

source: Course form
es: Formulario del curso

source: New course
es: Nuevo curso

source: Students
es: Estudiantes

source: List of students
es: Lista de estudiantes

source: Student
es: Estudiante

source: Student form
es: Formulario de estudiante

source: New student
es: Nuevo estudiante

source: Teachers
es: Profesores

source: List of teachers
es: Lista de profesores

source: Teacher
es: Profesor

source: Teacher form
es: Formulario de profesor/a

source: New teacher
es: Nuevo profesor/a

source: Teacher notes
es: Notas del profesor/a

source: List of notes
es: Lista de notas

source: Teacher note
es: Nota de profesor/a

source: Teacher note form
es: Formulario de la nota de profesor/a

source: New note
es: Nueva nota

source: Manual data manipulation
es: Manipulación manual de datos

source: Inside a function
es: Dentro de una función

source: Database managed manually
es: Base de datos controlada manualmente

source: Database access example
es: Ejemplo de acceso a la base de datos

source: Paginated listing by query
es: Listado paginado por consulta

source: Your own paginated listings
es: Tus propios listados paginados

source: Database listing example
es: Ejemplo de listado por base de datos

source: Listings by array
es: Listados por array

source: Your own listings
es: Tus propios listados

source: Array listing example
es: Ejemplo de listado por array

source: Array listing example with link
es: Ejemplo de listado por array con enlace

source: Forms
es: Formularios

source: Your own forms
es: Tus propios formularios

source: Form simple example
es: Ejemplo de formulario simple

source: Example 1
es: Ejemplo 1

source: Example 2
es: Ejemplo 2

source: Form group example
es: Ejemplo de formulario agrupado

source: Notes of teacher
es: Notas del profesor

source: The teacher ID is hidden
es: El ID del profesor está oculto

source: The notes ID are hidden
es: El ID de las notas está oculto

source: Internationalization
es: Internalización

source: Internationalization: prepare the plugin for future translations
es: Internalización: prepara el plugin para futuras traducciones

source: Miscellany
es: Miscelánea

source: Other functions, test and BFT possibilities
es: Otras funciones, pruebas y posibilidades de BFT

source: Log
es: Registro

source: The WordPress log with BFT
es: El registro de WordPress con BFT

source: Functions visibility
es: Visibilidad de las funciones

source: What functions visibility is needed
es: Qué visibilidad de las funciones se necesitan

source: Security
es: Seguridad

source: Secure the functions
es: Asegura las funciones

source: Errors
es: Errores

source: Manage and display errors
es: Controla y muestra errores

source: Throw error and return to parent
es: Lanza un error y vuelve al padre

source: Download
es: Descarga

source: Download files
es: Descarga archivos

source: Download private file
es: Descarga archivos privados

source: Iframe on a page
es: Iframe en una página

source: Iframe by slug
es: Iframe por slug

source: URL iframe
es: URL del iframe

source: PDF example
es: Ejemplo PDF

source: Iframe by slug - PDF example
es: IFrame por slug - ejemplo PDF

source: Languages
es: Idiomas

source: Language functions
es: Funciones de idiomas

source: Countries
es: Países

source: County function
es: Funciones de países

source: Currencies
es: Divisas

source: Currency functions
es: Funciones de divisas

source: Frontend explanation
es: Explicación del frontend

source: Shorcode system
es: Sistema de shortcodes

source: AJAX system
es: Sistema de AJAX

source: AJAX form
es: Formulario AJAX

source: AJAX form system
es: Sistema del formulario AJAX

source: Your page
es: Tu página

source: Try to modify
es: Prueba a modificar

source: Try to modify admin/partials/your-plugin-admin-display-hello-world.php
es: Prueba a modificar admin/partials/your-plugin-admin-display-hello-world.php

source: Available languages
es: Idiomas disponibles

source: Main language
es: Idioma principal

source: Default country
es: País principal

source: Admin email where to send the notifications
es: Email del administrador donde enviar las notificaciones

source: How show the dates on the client side
es: Cómo mostrar las fechas en el lado del cliente

source: Currency
es: Divisa

source: Show the currency before o after price
es: Mostrar la divisa antes o después del precio

source: Before
es: Antes

source: After
es: Después

source: Dot or comma for decimals on the client side
es: Punto o coma para los decimales en el lado del cliente

source: dot
es: punto

source: comma
es: coma

source: Display decimals in an integer on the client side
es: Mostrar decimales en un número entero en el lado del cliente

source: Show the number as a decimal
es: Mostrar el número como un decimal

source: Show the number as an integer
es: Mostrar el número como un entero

source: Items per page of the lists
es: Elementos por página en las listas

source: Test settings
es: Ajustes de prueba

source: Text input
es: Input text

source: Textarea input
es: Input textarea

source: Number input
es: Input number

source: Select input
es: Input select

source: Chinesse
es: Chino

source: English
es: Inglés

source: Spanish
es: Español

source: Select multiple input
es: Input select múltiple

source: Date input
es: Input fecha

source: Checkbox input
es: Input checkbox

source: Checkbox multiple input
es: Input checkbox múltiple

source: Radio input
es: Input radio

source: Image input
es: Input imagen

source: File input
es: Input archivo

source: Input commented
es: Input comentado

source: Total hours of the course
es: Horas totales del curso

source: Hours
es: Horas

source: Course name
es: Nombre del curso

source: Name
es: Nombre

source: Course logo
es: Logo del curso

source: Image
es: Imagen

source: Order
es: Orden

source: Order, lowest number first
es: Orden, número más pequeño primero

source: Teacher not selected
es: Profesor no seleccionado

source: Enrolled students
es: Estudiantes matriculados

source: Surname
es: Apellidos

source: ID card
es: DNI

source: Student photo
es: Fotografía del estudiante

source: Country
es: País

source: Telephone
es: Teléfono

source: Postcode
es: Código postal

source: City
es: Ciudad

source: Province
es: Provincia

source: Address
es: Fecha

source: Enrolled courses
es: Cursos matriculados

source: Teacher photo
es: Fotografía del profesor

source: Type of teacher
es: Tipo de profesor

source: Permanent or substitute teacher?
es: Profesor permamente o sustituto?

source: Permanent teacher
es: Profesor permamente

source: Substitute teacher
es: Profesor sustituto

source: Title
es: Título

source: Note
es: Nota

source: Database was installed already
es: Base de datos ya instalada

source: Security text mismatch
es: Error de coincidencia en el texto de seguridad

source: Error message
es: Mensaje de error

source: What's BFT
es: Qué es BFT

source: What is Backend Frontend Template?
es: ¿Qué es Backend Frontend Template?

source: First steps with BFT
es: Primeros pasos con BFT

source: The menu system
es: El sistema de menú

source: Frontend: shorcode system
es: Frontend: sistema de shortcodes

source: Want more?
es: ¿Quieres más?

source: Want to save even more time?
es: ¿Quieres ahorrar aún más tiempo?

source: Admin permission denied
es: Permisos de administración denegado

source: page name error
es: error en el nombre de la página

source: user capabilities error
es: error en las capacidades del usuario

source: File not specified
es: Archivo no especificado

source: File not found
es: Archivo no encontrado

source: File aux not found
es: Archivo auxiliar no encontrado

source: redirected to the parent page
es: redireccionado a la página padre

source: redirected to a parent page
es: redireccionado a una página padre

source: Error detected
es: Error detectado

source: Changes saved
es: Cambios guardados

source: has repeated IDs, some unexpected errors may occur
es: tiene IDs repetidos, pueden ocurrir algunos errores inesperados

source: has repeated slugs, some unexpected errors may occur
es: tiene slugs repetidos, pueden ocurrir algunos errores inesperados

source: page not found
es: página no encontrada

source: missing menu slug
es: menú slug no encontrado

source: Admin pages main menu error
es: Error en el menú principal de las páginas de administración

source: Example images are now loaded from moisesbarrachina.online to make the plugin lighter
es: Las imágenes de ejemplo ahora se cargan desde moisesbarrachina.online para hacer más liviano el plugin

source: Improved explanation and readability of texts
es: Mejorada la explicación y legibilidad del los textos

source: Fixed typos
es: Corregidos errores tipográficos

source: Upgrade guide
es: Guía de upgrade

source: Select the entire plugin, give to find and replace, select Caps Match and Replace
es: Seleccionar todo el plugin, darle a buscar y reemplazar, seleccionar concordancia de mayúsculas y reempazar

source: First stable version of Backend Frontend Template
es: Primera versión estable de Backend Frontend Template

source: Menú system
es: Sistema de menú

source: Log manipulation
es: Manipulación del log

source: Error manipulation
es: Manipulación errores

source: Frontend system by shortcode
es: Sistema de frontend por shortcode

source: Internalization into Spanish
es: Interiorización al español

source: Menu system with children
es: Sistema de menú con hijos

source: Settings system
es: Sistema de ajustes

source: Inputs system: text, textarea, number, select, select multiple, date, checkbox, checkbox multiple, radio, image, file and input comented
es: Sistema de ipunts:text, textarea, number, select, select multiple, fecha, checkbox, checkbox múltiple, radio, imagen, archivo e input comentado

source: Install and deinstall plugin database
es: Instalar y desinstalar la base de datos del plugin

source: Direct listing by array
es: Listado directo por array

source: Manual form
es: Formulario manual

source: Download system for private files
es: Sistema de descargar para archivos privados

source: Iframe system
es: Sistema de iframes

source: PDF by iframe system
es: PDF por sistema de iframes

source: AJAX frontend system
es: Sistema AJAX por frontend

source: The log in WordPress is activated in
es: El log en WordPress se activa en

source: change
es: cambia

source: Now you can check the log in
es: Ahora puedes comprobar el log en

source: For printing to the log you can use the WordPress function
es: Para imprimir en el log puedes usar la función de WordPress

source: but with Backend Frontend Template you can use
es: pero con Backend Frontend Template puedes usar

source: it's a better option because it shows
es: es mejor opción porque muestra

source: if its a NULL variable
es: si es una variable NULL

source: and
es: y

source: if it's a boolean
es: si es un booleano

source: if it's an array or object
es: si es un array o un objeto

source: Now you can print in the log whatever variable you want
es: Ahora puedes imprimir en el log la variable que quieras

source: Also BFT offers an alternative name for
es: Además BFT ofrece un nombre alternativo para

source: Backend Frontend Template provides several functions about countries
es: Backend Frontend Template ofrece varias funciones sobre los países

source: Backend Frontend Template provides several functions about currencies
es: Backend Frontend Template ofrece varias funciones sobre las monedas

source: Backend Frontend Template provides several functions about languages
es: Backend Frontend Template ofrece varias funciones sobre los idiomas

source: Returns a country list
es: Devuelve la lista de países

source: Returns the country name through the country code
es: Devuelve el nombre del país a través del código del país

source: Use of the class
es: Uso de la clase

source: and other WordPress functions
es: y otras funciones de WordPress

source: Basic structure for a WordPress plugin
es: Estructura básica de un Plugin de WordPress

source: JavaScript library
es: Librería JavaScript

source: System to expand the possibilities of the forms
es: Sistema para expandir las posibilidades de los formularios

source: the admin CSS is a handmade cut to make it less intrusive with the WordPress admin CSS
es: el CSS del administrador está hecho a mano para hacerlo menos intusivo con el CSS del administador de WordPress

source: jQuery plugin for expande the select posibilities
es: Plugin jQuery para expandir las posibilidades de los selects

source: Manipulate and display dates and times in JavaScript
es: Manipular y mostrar fechas y horas en JavaScript

source: Date range selection
es: Selección de un rango de fechas

source: Returns a currency list with all the data, including the numer of currency on the ISO 4217 standard
es: Devuelve a una lista de divisas con todos los datos, incluyendo el número de divisa según el estándard ISO 4217

source: Returns a currency list
es: Devuelve una lista de divisas

source: Returns the currency symbol through the currency code
es: Devuelve el símbolo de una divisa a través del código de divisa

source: Returns the ISO 4217 number through the currency id
es: Devuelve el número ISO 4217 a través de la ID de la divisa

source: expand your posibilities, make a lot more on less time
es: expande tus posibilidades, haz más en menos tiempo

source: Check it out on the shop and save time!
es: ¡Compruébalo en la tienda y ahorra tiempo!

source: Add child pages and organize better your plugin
es: Añade páginas hijas y organiza mejor tu plugin

source: Create, manage and store WordPress variables with setting pages, it's really easy
es: Crea, administra y guarda variables de WordPress con páginas de ajustes

source: Advance inputs
es: Inputs avanzados

source: Add inputs like images, select multiples, etc.
es: Añade inputs como imágenes, selects múltiples, etc.

source: Play around with the example data all you want
es: Juega con los datos de ejemplo todo lo que quieras

source: Install or delete the plugin database
es: Instala o elimina la base de datos del plugin

source: Add menu for (de)install your plugin database
es: Añade menú para instalar/desinstala tu base de datos del plugin

source: Manage all the data only specifying the table and the fields. The table can have internationalized fields
es: Administra tods los datos sólo especificando la tabla y los campos. La tabla puede tener campos internacionalizados

source: More functions to manage manually the database
es: Más funciones para administrar manualmente la base de datos

source: A WordPress paginated listing style thanks to a SQL query in pieces
es: Listado paginado estilo WordPress gracias a una consulta SQL en piezas

source: A WordPress listing style thanks to an array
es: Listado estilo WordPress gracias a un array

source: Easy method for download private files
es: Método fácil para descargar archivos privados

source: Insert easy iframes, PDFs too
es: Inserta iframes fácilmente, PDFs también

source: More functions and examples for the frontend
es: Más funciones y ejemplos para el frontend

source: Buy Backend Frontend Template Pro now and save time!
es: ¡Compra Backend Frontend Template Pro ahora y ahorra tiempo!

source: Upgrading later
es: Actualizando más tarde

source: You can start now with the totally free version and later upgrade to BFT Pro
es: Puedes empezar ahora con la versión totalmente gratuita y actualizar después a BFT Pro

source: When you buy Backend Frontend Template Pro you will have two folders in the download, one folder has everything, a complete plugin, and the other folder only contains the new BFT Pro licensed files, so it will not replace any existing files
es: Cuando compras Backend Frontend Template Pro obtienes dos carpetas en la descarga, una carpeta tiene todo, un plugin completo, la otra carpeta sólo contiene los nuevos archivos licenciados de BFT Pro, por lo que no reemplazará ningún archivo existente

source: In addition, BFT checks if the BFT Pro folders exist, in which case it automatically loads the classes with the extra tools
es: Además, BFT comprueba si existe la carpeta BFT Pro, y en ese caso automáticamente carga las clases con las herramientas extra

source: This is an error test
es: Esto es una prueba de error

source: Show an error
es: Muestra un error

source: Backend Frontend Template can easily show errors, and it doesn't repeat the same error on the same load. Also: the plugin title will be add to the message
es: Backend Frontend Template puede mostrar errores fácilmente, y no repite el mismo error en la misma carga. Además: el título del plugin ser añadirá al mensaje

source: show an error message
es: muestra un mensaje de error

source: If
es: Si

source: it shows
es: muestra

source: Adding
es: Añadiendo

source: on the
es: en el

source: the error message can be triggered with the functions
es: el mensaje de error se puede activar con las funciones

source: or
es: o

source: Throw an error
es: Lanza un error

source: BFT can throw errors with
es: BFT puede lanzar errores con

source: error to send to
es: error para enviar a

source: but first it will display the 'error_message' stored in the URL
es: pero primero mostrará el 'error_message' guardado en la URL

source: for use this data instead of
es: para usar estos datos en vez de

source: options
es: opciones

source: default NULL
es: NULL por defecto

source: it use this data instead of
es: usa estos datos en vez de

source: for change the file displayed if error triggered
es: para cambiar el archivo mostrado si se lanza un error

source: default false
es: false por defecto

source: only works if
es: sólo funciona si

source: because it's needed do the redirect before sending the headers
es: porque es necesario hacer la redirección antes de enviar las cabeceras

source: the key/page name, if null it's the visualized page
es: la clave/nombre de la página, si NULL será la página visualizada

source: Examples
es: Ejemplos

source: This page show an error with
es: Esta página muestra un error con

source: The children page throws an error and return to this page with
es: La página hija lanza un error y vuelve a esta página con

source: A quick summary for what visibility to use on the functions of your plugin
es: Un resumen rápido sobre qué visibilidad usar en las funciones de tu plugin

source: Don't use private functions, BFT use inheritance on the classes and a private function can't inheritance
es: No uses funciones privadas, BFT usa herencia en las clases y una función privada no puede heredarse

source: Ideal for the internal functions for security reasons, only your classes can use these functions
es: Ideal para las funciones internas por razones de seguridad, sólo tus clases pueden usar estas funciones

source: Some functions need to be public due to how WordPress works
es: Algunas funciones necesitan ser públicas debido a cómo funciona WordPress

source: Functions called via
es: Funciones invocadas via

source: Functions called via install, upgrade or uninstall
es: Funciones invocadas via instalación, actualización o desistalación

source: Functions called via shortcodes
es: Funciones invocadas via shortcodes

source: Functions called via AJAX responses
es: Funciones invocadas via respuestas AJAX

source: This page is allocated on
es: Esta página está ubicada en

source: For specify a text that maybe needs translation, WordPress provides the functions
es: Para especificar un texto que quizás necesita traducción, WordPress proporciona las funciones

source: for direct translation and
es: para traducción directa y

source: for translation and escape the HTML characters
es: para traducción y escapar los caracteres HTML

source: for direct translation
es: para traducción directa

source: For more functions search on the WordPress documentation
es: Para más funciones buscar en la documentación de WordPress

source: link here
es: enlace aquí

source: With that, a translation plugin will be able to translate your plugin into the visitor language
es: Con eso, un plugin de traducción será capaz de traducir tu plugin al idioma del visitante

source: But if you want make your own translation for your own plugin: you can allocate the language files on
es: Pero si quieres hacer tu propia traducción para tu propio plugin: puedes alojar los archivos de idiomas en
