Repository: rszemeti/LiveBidderPLugin
Catalog: backend-frontend-template/languages/bft-internationalization-*.po
Languages: es

source: BFT automatically will set WordPress to search translations on that folder
es: BFT automáticamente configurará WordPress para buscar las traducciones en esa carpeta

source: The language files are
es: Los archivos de idiomas son

source: the master file with all the strings
es: el archivo maestro con todas las cadenas de texto

source: the file with the strings translated to one language
es: el archivo con las cadenas traducidas a un idioma

source: the compiled data of the .po file, WordPress use this file
es: los datos compilados del archivo .po, WordPress usará este archivo

source: For create the files you can use programs like
es: Para crear los archivos puedes usar programas como

source: Returns a language list
es: Devuelve una lista de idiomas

source: Returns the data stored in the setting
es: Devuelve los datos guardados en el ajuste

source: if exists on
es: si existe en

source: If languages empty it will set the languages 'en' and 'es'
es: Si idiomas está vacío configurará los idiomas 'en' y 'es'

source: If language_admin empty or not found on languages, it will set the first language stored in languages
es: Si language_admin está vacío o no es encontrado en los idiomas, se configurará el primer idioma guardado en languages

source: Edit your menu in the variable
es: Edita tu menú en la variable

source: of the file
es: del archivo

source: Designing a BFT menu look like this
es: Diseñar un menú BFT se ve así

source: can have all the pages you want, but in BFT the admin pages can't have children, that's only possible on
es: puede tener todas las páginas que quieras, pero en BFT las páginas de administración no pueden tener hijos, eso sólo es posible en

source: the array data is expanded by the function
es: los datos del array son expandidos por la función

source: if you make an
es: si haces un

source: on a page: you can see the actual state of the array on the WordPress Log
es: en una página: puedes ver el estado atual del array en el log de WordPress

source: Explaining the BFT menu
es: Eplicación del menú BFT

source: Automatic parameters added to the array
es: Parámetros automáticos añadidos al array

source: the array key
es: la clave del array

source: More automatic parameters on BFT Pro
es: Más parámetros automáticos en BFT Pro

source: Parametters with default data if missing
es: Parámetros con datos por defecto si no están

source: page title
es: título de la página

source: default
es: por defecto

source: page tab title
es: título de la pestaña de la página

source: page slug
es: slug de la página

source: key page
es: clave de la página

source: The menu slug will be changed to
es: El menú slug se cambiará a

source: because it's needed a unique page name among the plugins
es: porque es necesario un nombre de página único entre los plugins

source: if false does not display the page tab, even if the page is selected
es: si false no muestra la pestaña de la página, incluso si la página está seleccionada

source: the function for when a page is displayed
es: la función para cuando una página se muestra

source: loads the function before a page is displayed
es: carga la función antes de que la página se muestre

source: the
es: el

source: file that will be displayed
es: archivo que se mostrará

source: If the file starts with
es: Si el archivo empieza con

source: the file will be loaded of the folder
es: el archivo se cargará de la carpeta

source: it's used on error_throw
es: es usado en error_throw

source: show the error
es: muestra el error

source: default option
es: opción por defecto

source: show the error and stop the execution
es: muestra el error y para la ejecución

source: go to the parent page and anotes on the GET data the error
es: va a la página padre y anota en los datos GET el error

source: only works on
es: sólo funciona en

source: and if
es: y si

source: because on a normal WordPress function will cause the error
es: porque en una función normal de WordPress causará el error

source: change the file option if
es: cambia la opción de archivo si

source: is triggered
es: es activado

source: WordPress capabilities
es: capacidades de WordPress

source: More parameters on BFT Pro
es: Más parámetros en BFT Pro

source: Available functions out of the box
es: Functions disponibles listas para usar

source: you can create whatever function you need
es: puedes crear cualquier función qué necesites

source: displays the page selected on
es: muestra la página seleccionada en

source: More functions on
es: Más functions en

source: Functions load available out of the box
es: Functions load disponibles listas para usar

source: More functions load on
es: Más functions load en

source: Optional parameters
es: Parámetros opcionales

source: copy the data of a page. Only copy the data not found on the page, neither copy id, is_child, page_parent, menu_slug and children
es: copia los datos de una página. Sólo copia los datos no encontrados en la página, tampoco copia el id, is_child, page_parent, menu_slug y children

source: More optional parameters on
es: Más parámetros opcionales en

source: Your own parameters
es: Tus propios parámetros

source: You can create your own parameter, later on you can access to the info on a function or on a page with
es: Puedes crear tu propio parámetros, después puedes acceder a la información desde una función o una página con

source: And if you want you can retrieve the data of a certain page with
es: Y si quieres puedes recuperar los datos de una página en concreto con

source: and retrieve all the array data with
es: y recuperar todos los datos del array con

source: You can set later your own parameter by code with
es: Puedes establecer tus propios parámetros por código con

source: This is an error message
es: Esto es un mensaje de error

source: This is a success message
es: Esto es un mensaje de éxito

source: Make the plugin your own
es: Haz que el plugin sea tuyo

source: Change the files of
es: Cambia los archivos de

source: with the id of your plugin
es: con el id de tu plugin

source: like
es: como

source: Delete the files or change their extension
es: Elimina los archivos o cambia sus extensiones

source: Change the extension of the files to PHP
es: Cambia la extensión de los archivos a PHP

source: Uncomment
es: Descomenta

source: Find and replace all the file names with
es: Busca y reemplaza los nombres de los archivos con

source: to your plugin id
es: a tu plugin id

source: example
es: ejemplo

source: On
es: En

source: replace the file names with
es: reemplaza los nombres de archivo con

source: to
es: a

source: Go to search and replace of your editor, active 'match case' and replace these strings
es: Ve a buscar y reemplazar de tu editor, activa 'coincidir mayúsculas y minúsculas' y reemplaza estas cadenas

source: Go to search and replace of your editor, active 'match case' and replace the words with the names and ids of your plugin
es: Ve a buscar y reemplazar de tu editor, activa "coincidir mayúsculas y minúsculas" y reemplaza estas palabas con los nombres e ids de tu plugin

source: Replace the icon for you own on
es: Reemplaza el icono por el tuyo propio en

source: Know the main plugin folders
es: Conoce las principales carpetas del plugin

source: administration folder
es: carpeta de administración

source: global folder
es: carpeta global

source: for administration and plublic files
es: para archivos de administración y públicos

source: translation files
es: archivos de traducción

source: theses binarian files are made with programs like
es: estos archivos binarios se crean con programas como

source: for sensitive data that only a download script can send the file to the user
es: para datos sensibles que sólo un script de descarga pueda enviar el archivo al usuario

source: public folder
es: carpeta pública

source: Know the plugin sub-folders
es: Conoce las sub carpetas del plugin

source: CSS files
es: archivos CSS

source: images
es: imágenes

source: JavaScript files
es: archivos JavaScript

source: library
es: librería

source: the internal BFT files are stored here
es: los archivos internos de BFT se guardan aquí

source: frontend files
es: archivos frontend

source: Know the main files
es: Conoce los archivos principales

source: using the original filenames
es: usando los nombres originales de los archivos

source: main class of the plugin
es: clase principal del plugin

source: control when the plugin is activated
es: controla cuando el plugin es activado

source: control when the plugin is deactivated
es: controla cuando el plugin es desactivado

source: control the cronjobs of the plugin
es: controla los cronjobs del plugin

source: install and erase the plugin database
es: instala y elimina la base de datos del plugin

source: class with functions for admin and public classes
es: clase con funciones para las clases de administración y pública

source: it's an extension of the BFT admin-public class
es: es una extensión de la clase BFT admin-public

source: class for the admin section
es: clase para la sección de administración

source: it's an extension of the BFT admin-public class, your admin-public class and BFT admin class
es: es una extensión de la clase BFT admin-public, tu clase admin-public y la clase BFT admin

source: class for the public section
es: clase para la sección pública

source: it's an extension of the BFT admin-public class, your admin-public class and BFT public class
es: es una extensión de la clase BFT admin-public, tu clase admin-public y la clase BFT public

source: See the examples
es: Mira los ejemplos

source: On the next tabs you can see examples of how to work with Backend Frontend Template
es: En las siguientes pestañas puedes ver como trabajar con Backend Frontend Template

source: The 'function_load' option of the menu is the function that the page executes before sending the HTML headers
es: La opción 'function_load' del menú es la función que la página ejecuta antes de enviar las cabeceras HTML

source: By default all pages execute
es: Por defecto todas las las páginas ejecutan

source: the executed function can be changed on
es: la función ejecutada puede cambiarse en

source: The function
es: La función

source: checks if the admin capabilities are correct and if the id required data is not missing. In this function it works the
es: comprueba si las capacidades administrativas son correctas y si el id requerido está. En esta función funciona el

source: option of the menu (the id check only on Backend Frontend Template Pro)
es: opción del menú (la comprobación del id sólo en Backend Frontend Template Pro)

source: This function can be called at the beginning of a custom function_load to check all before save changes
es: Esta función puede llamarse al principio de una function_load personalizada para comprobar todo antes de guardar los cambios

source: NOTE
es: NOTA

source: id required data and go to parent are only BFT Pro options
es: los datos id requeridos e ir a los padres son sólo opciones de BFT Pro

source: The 'function' option of the menu is the main function that the page executes
es: La opción 'function' del menú is la función principal que la página ejecuta

source: checks if the admin capabilities are correct and if the id required data is not missing
es: comprueba si las capacidades administrativas son correctas y si faltan los datos id requeridos

source: On a custom function there are functions for checking the access and to retrieve the ids
es: En una función personalizada hay funciones para comprobar el acceso y recuperar los ids

source: check the admin permissions and throw an error if needed. Recommended for use at the beginning of the function
es: comprueba los permisos de administración y lanza un error si es necesario. Se recomienda usar al principio de la función

source: More functions on BFT Pro
es: Más funciones en BFT Pro

source: It's easy create an manage shotcodes with BFT
es: Es fácil crear y administrar shortcodes con BFT

source: Defining a shortcode
es: Definiendo un shortcode

source: The shortcodes on BFT are defined on
es: Los shortcores en BFT son definidos en

source: The structure of a shortcode is
es: La estructura de un shortcode es

source: Defining a function
es: Defininendo un función

source: The structure of a shortcode function is
es: La estructura de una función del shortcode es

source: The variables of the function are
es: Las variables de la función son

source: array with all the data specified on the shortcode
es: array con todos los datos especificados en el shortcode

source: the content within the two tags, if the shortcode uses a clossing tag
es: el contenido dentro de las dos etiquetas, si el shortcode usa una etiqueta de cierre

source: the shotcode tag
es: la etiqueta del shortcode

source: Shortcodes uses examples
es: Ejemplos de usos de shortcodes

source: A shortcode without data on
es: Un shortcode sin data en

source: Shortcode with data on
es: Shortcode con datos on

source: Content data
es: Datos del contenido

source: Complete example
es: Ejemplo completo

source: Try it for yourself
es: Pruébalo tu mismo

source: Create a page, insert a shortcode block and put
es: Crea una page, inserta un bloque de shortcode y pon

source: Or
es: O

source: This is an additional text
es: Esto es un texto adicional

source: The text inside de tags
es: El texto dentro de las etiquetas

source: is a template and library
es: es una plantilla y librería

source: for develop WordPress plugins easily and quickly
es: con la que desarrollar plugins para WordPress de forma fácil y rápida

source: Save time, do more
es: Ahorra tiempo, haz más

source: It's not needed to know all the
es: No es necesario saber toda la

source: WordPress developer plugin documentation
es: documentación para desarrollos de plugin para WordPress

source: with this template/library you can develop your plugin now only following the
es: con esta plantilla/librería puedes desarrollar tu plugin ya sólo siguiendo la

source: first steps page
es: página de primeros pasos

source: Backend Frontend Template is available on GitHub
es: Backend Frontend Template está disponible en GitHub

source: Do you want more capabilities/possibilities and save more time?
es: ¿Quieres más capacidades/posibilidades y ahorrar más tiempo?

source: check
es: comprueba

source: are libraries in continuous growth and developed by
es: son librerías en continuo crecimiento y desarrolladas por

source: Missing required ID
es: ID requerido no encontrado

source: Error finding the form
es: Error encontrando el formulario

source: column_key not defined
es: column_key no definido

source: Children array not found
es: Array hijo no encontrado

source: New
es: Nuevo

source: Error finding the key of the form
es: Error ecnontrando la key del formulario

source: Error finding the GET key name of the form
es: Error encontrando el nombre GET de la clave del formulario

source: Error retrieving ID
es: Error recuperando ID

source: new
es: nuevo

source: nameless
es: sin nombre

source: Missing data on custom_form_html
es: Faltan datos en custom_form_html

source: Select a image
es: Seleccionar una imagen

source: Remove the image
es: Quitar la imagen

source: Select a file
es: Seleccionar un archivo

source: Remove the file
es: Quitar el archivo

source: Input type
es: Tipo de input

source: not implemented yet
es: no implementado todavía

source: Error on action and/or id of the form
es: Error en acción y/o id del formulario

source: Invalid data, entry cannot be created
es: Datos no válidos, no se puede crear la entrada

source: Invalid data to query the database
es: Datos no válidos para hacer la query a la base de datos

source: Search
es: Buscar

source: Error on auto query
es: Error en query automática

source: Table of column_key missing on
es: Tabla de column_key no encontrada en display_table_query_custom

source: Error retrieving data of custom query
es: Error recuperando datos de la consulta personalizada

source: query anoted on WordPress log
es: query anotada en el log de WordPress

source: Nothing selected
es: Nada seleccionado

source: Warning: The form will fail, first enter the required data of this section
es: Aviso: El formulario fallará, primero entrar los datos requeridos de esta sección

source: Missing required data
es: Datos requeridos no encontrados

source: Missing required columns
es: Columnas requeridas no encontardas

source: See all entries
es: Ver todas las entradas

source: Edit
es: Editar

source: Compact view
es: Vista compatada

source: Extended view
es: Vista extendida

source: No items found.
es: No se encontraron elementos.

source: Select bulk action
es: Seleccionar acción masiva

source: Bulk actions
es: Acciones masivas

source: Apply
es: Aplicar

source: Show more details
es: Mostrar más detalles

source: All dates
es: Todas las fechas

source: %s comment
es: %s comentario

source: %s approved comment
es: %s comentario aprovado

source: %s pending comment
es: %s comentario pendiente

source: No comments
es: Sin comentarios

source: No approved comments
es: Sin comentarios aprovados

source: No pending comments
es: Sin comentarios pendientes

source: %s item
es: %s ítem

source: First page
es: Primera página

source: Previous page
es: Página anterior

source: Current Page
es: Página actual

# paging
source: %1$s of %2$s
es: %1$s de %2$s

source: Next page
es: Página siguiente

source: Last page
es: Última página

source: Select All
es: Seleccionar todo

source: From an AJAX response to a form there are only a few steps to considerer
es: De una respuesta AJAX a un formulario sólo hay algunos pasos a considerar

source: Initial shortcode
es: Shortcode inicial

source: Explanation
es: Explicación

source: On the HTML data will be a form with the 'action' data, the data will be read with
es: En los datos HTML estará el formulario con el dato 'action', los datos se leerán con

source: Besides, the form data will have a nonce if the user is logged, for additional security
es: Además, los datos del formulario tendrán un nonce si el usuario está logueado, para seguridad adicional

source: AJAX response
es: respuesta AJAX

source: An AJAX form will check the nonce for logged users before use the data with
es: Un formulario AJAX comprobará el nonce para usuario logeados antes de usar los datos con

source: if the nonce fails the execution will stop
es: si el nonce falla la ejecución parará

source: It's easy to add AJAX on your shortcodes
es: Es fácil añadir AJAX en tus shortcodes

source: The shortcode will not change, the only change is on the partial page, that page will have the JavaScript AJAX data
es: El shortcode no cambiará,el único cambio está en la página parcial, esa página tendrá los datos JavaScript AJAX

source: You can use your own method, but BFT uses jQuery, the functions provided by
es: Puedes usar tu propio método, pero BFT usa jQuery, las funciones proporcionadas por

source: are designed for be printed inside of a jQuery script
es: están preparadas para ser impresas dentro de un script jQuery

source: provides JavaScript functions to show error on the designed container and erase the HTML data on the main container
es: provee funcioens JavaScript para mostrar error en el contenedor seleccionado y borrar los datos HTML en el contenedor principal

source: For the WordPress side is needed
es: Para la parte WordPress, es necesario

source: Defining an AJAX WordPress Action
es: Definiendo una Acción AJAX de WordPress

source: The AJAX responses are defined on
es: Las respuestas AJAX son definidas en

source: The structure of a AJAX response is double, WordPress separates the logged ussers of non logged users
es: La estructura de una respuesta AJAX es doble, WordPress separa los usuarios logeados de los usuarios no logeados

source: This function doesn't has variables, all pass data will be POST data
es: Esta función no tiene variables, todos los datos pasados serán datos POST

source: For preparing the return data, BFT uses this structure:
es: Para preparar los datos de vuelva, BFT usa esta estructura:

source: For sending the data, the function will use the WordPress functions
es: Para senviar los datos, la función usará las funciones de WordPress

source: Returning an error
es: Devolviendo un error

source: Backend Frontend Template provides the function
es: Backend Frontend Template provee la función

source: will return the JSON and will stop the execution of the code
es: devolverá el JSON y parará la ejecución del código

source: it's provided by Backend Frontend Template with the variable
es: lo proporciona Backend Frontend Template con la variable

source: Required fields on the database table
es: Campos necesarios en la tabla de la base de datos

source: For display and manipulate the data automatically we need a few dedicated fields in a table
es: Para mostrar y manipular los datos automáticamente necesitaremos unos pocos campos dedicados en una tabla

source: Status, enum type, field name decided in
es: Estado, tipo enumerado, nombre del campo decidido en

source: for the enum options use the stored data on
es: para las opciones del enumerado usa los datos almacenados en

source: Created time, datetime type, field name decided in
es: Tiempo de creación, tipo datetime, nombre del campo decidido en

source: Modified time, datetime type, field name decided in
es: Tiempo de modificación, tipo datetime, nombre del campo decidido en

source: Removed time (moved to bin), datetime type, field name decided in
es: Tiemp ode eliminación (movido a la papelera), tipo datetime, nombre del campo decidido en

source: Plus the table can have an internationalization (i18n) table, that table will have a foreign_key pointing to id of the main table
es: Además la tabla puede tener una tabla de internalización (i18n), esa tabla tendrá una foreign_key apuntando al id de la tabla principal

source: An example of a table with an internationalization table
es: Un ejemplo de una tabla con tabla de internalización

source: Note: don't use 'wp_', a WordPress installation maybe use other prefix, use instead
es: Nota: no usar 'wp_', una instalación de WordPress quizás usa otro prefijo, usar en su lugar

source: Warning
es: Aviso

source: 'name' can't be used for a column a i18n table. WordPress clean the data automatically of all 'name' appearances and WordPress doesn't expect an array of data
es: 'name' no puede ser usado en una columna de una tabla i18n. WordPress limpia los datos automáticamente de todas las apariciones de 'name' y WordPress no espera datos array

source: it's an array because its the text in each language
es: es un array porque es el texto en cada idioma

source: On the many to many relationships is needed the created time and modified time
es: En las relaciones muchos a muchos is necesario la fecha de creación y fecha de modificación

source: Students doesn't described on this page example, the foreign key can't work if you copy the query
es: Estudiantes no descritos en esta página de ejemplo, la clave foránea no puede funcionar si copias la query

source: The forms are described in
es: Los formularios son descritos en

source: a form it's the union of a table and its internationalization
es: un formulario es la unicón de su tabla y su internalización

source: Designing a BFT form looks like this
es: Diseñar un formulario BFT se ve así

source: Form parameters
es: Parámetros del formulario

source: internal form id
es: internal id del formulario

source: table name
es: nombre de la tabla

source: key name ('id' usually)
es: nombre de la clave ('id' normalmente)
