Repository: rszemeti/LiveBidderPLugin
Catalog: backend-frontend-template/languages/bft-internationalization-*.po
Languages: es

source: Interlingua (International Auxiliary Language Association)
es: Interlingua (Asociación Internacional de Idiomas Auxiliares)

source: Interlingue
es: Interlingüismo

source: Irish
es: Irlandés

source: Italian
es: Italiano

source: Japanese
es: Japonés

source: Javanese
es: Javanés

source: Kannada
es: Canarés

source: Kashmiri
es: Cachemira

source: Kazakh
es: Kazajo

source: Korean
es: Coreano

source: Kurdish
es: Kurdo

source: Kyrgyz
es: Kirguís

source: Lao
es: Laosiano

source: Latin
es: Latín

source: Latvian
es: Letón

source: Letzeburgesch, Luxembourgish
es: Letzeburgesch, Luxemburgués

source: Limburgish, Limburgan, Limburger
es: Limburgués

source: Lithuanian
es: Lituano

source: Macedonian
es: Macedónio

source: Malagasy
es: Madagascarí

source: Malay
es: Malayo

source: Maltese
es: Maltés

source: Manx
es: Manés

source: Maori
es: Maorí

source: Marshallese
es: Marshalés

source: Moldovan, Moldavian, Romanian
es: Moldavo, Moldavo, Rumano

source: Mongolian
es: Mongol

source: Navajo, Navaho
es: Navajo

source: Northern Ndebele
es: Ndebele Septentrional

source: Nepali
es: Nepalí

source: Northern Sami
es: Sami Septentrional

source: Norwegian
es: Noruego

source: Norwegian Bokmål
es: Bokmal Noruego

source: Norwegian Nynorsk
es: Nynorsk Noruego

source: Occitan
es: Occitano

source: Ossetian, Ossetic
es: Osetio, Osético

source: Panjabi, Punjabi
es: Panyabí, Punjabí

source: Pashto, Pushto
es: Pastún

source: Persian
es: Persa

source: Polish
es: Polaco

source: Portuguese
es: Portugués

source: Romansh
es: Romanche

source: Russian
es: Ruso

source: Samoan
es: Samoano

source: Sanskrit
es: Sánscrito

source: Sardinian
es: Sardo

source: Serbian
es: Serbio

source: Sinhala, Sinhalese
es: Cingalés

source: Slovak
es: Eslovaco

source: Slovenian
es: Esloveno

source: Somali
es: Somalí

source: Sotho, Southern
es: Sotho Meridional

source: South Ndebele
es: Ndebele Meridional

source: Sundanese
es: Sundanés

source: Swahili
es: Suajilisuajili

source: Swedish
es: Sueco

source: Tagalog
es: Tagalo

source: Tahitian
es: Tahitiano

source: Tajik
es: Tayiko

source: Tatar
es: Tártaro

source: Thai
es: Tailandés

source: Tibetan
es: Tibetano

source: Tonga (Tonga Islands)
es: Tonga (Islas Tonga)

source: Turkmen
es: Turkmeno

source: Uighur, Uyghur
es: Uigures

source: Ukrainian
es: Ucranio

source: Uzbek
es: Uzbeco

source: Vietnamese
es: Vietnamita

source: Walloon
es: Valón

source: Welsh
es: Galés

source: Western Frisian
es: Frisón Occidental

source: Yiddish
es: Yidis,​ Yiddish, Ídish, Judeoalemán

source: Zulu
es: Zulú

source: Afghanistan
es: Afganistán

source: Aland Islands
es: Islas Aland

source: Algeria
es: Argelia

source: American Samoa
es: Samoa Americana

source: Anguilla
es: Anguila

source: Antarctica
es: Antártida

source: Antigua And Barbuda
es: Antigua y Barbuda

source: Austria
es: Australia

source: Azerbaijan
es: Azerbaiyán

source: Bahrain
es: Baréin

source: Belarus
es: Bielorrusia

source: Belgium
es: Bélgica

source: Belize
es: Belice

source: Benin
es: Benín

source: Bermuda
es: Islas Bermudas

source: Bhutan
es: Bután

source: Bosnia And Herzegovina
es: Bosnia y Herzegovina

source: Botswana
es: Botsuana

source: Bouvet Island
es: Isla Bouvet

source: Brazil
es: Brasil

source: British Indian Ocean Territory
es: Territorio Británico del Océano Índico

source: Cambodia
es: Camboya

source: Cameroon
es: Camerún

source: Canada
es: Canadá

source: Cape Verde
es: Cabo Verde

source: Cayman Islands
es: Islas Caimán

source: Central African Republic
es: República Centroafricana

source: Christmas Island
es: Isla de Navidad

source: Cocos (Keeling) Islands
es: Islas Cocos (Keeling)

source: Comoros
es: Comoras

source: Congo, Democratic Republic
es: Congo, República Democrática

source: Cook Islands
es: Islas Cook

source: Cote D'Ivoire
es: Costa de Marfil

source: Croatia
es: Croacia

source: Cyprus
es: Chipre

source: Czech Republic
es: República Checa

source: Denmark
es: Dinamarca

source: Djibouti
es: Yibuti

source: Dominican Republic
es: República Dominicana

source: Egypt
es: Egipto

source: Equatorial Guinea
es: Guinea Ecuatorial

source: Ethiopia
es: Etiopía

source: Falkland Islands (Malvinas)
es: Islas Malvinas

source: Faroe Islands
es: Islas Faroe

source: Fiji
es: Fiyi

source: Finland
es: Finlandia

source: France
es: Francia

source: French Guiana
es: Guayana Francesa

source: French Polynesia
es: Polinesia francesa

source: French Southern Territories
es: Territorios Franceses del Sur

source: Gabon
es: Gabón

source: Germany
es: Alemania

source: Greece
es: Grecia

source: Greenland
es: Groenlandia

source: Grenada
es: Granada

source: Guadeloupe
es: Guadalupe

source: Guernsey
es: Guernesey

source: Guyana
es: Guayana

source: Haiti
es: Haití

source: Heard Island & Mcdonald Islands
es: Islas Heard e Islas Mcdonald

source: Holy See (Vatican City State)
es: Santa Sede (Estado de la Ciudad del Vaticano)

source: Hungary
es: Hungría

source: Iceland
es: Islandia

source: Iran, Islamic Republic Of
es: Irán, República Islámica de

source: Iraq
es: Irak

source: Ireland
es: Irlanda

source: Isle Of Man
es: Isla del Hombre

source: Italy
es: Italia

source: Japan
es: Japón

source: Jordan
es: Jordán

source: Kazakhstan
es: Kazajstán

source: Kenya
es: Kenia

source: Korea
es: Corea

source: Kyrgyzstan
es: Kirguistán

source: Lao People's Democratic Republic
es: República Democrática Popular Lao

source: Latvia
es: Letonia

source: Lebanon
es: Líbano

source: Lesotho
es: Lesoto

source: Libyan Arab Jamahiriya
es: Jamahiriya Árabe Libia

source: Lithuania
es: Lituania

source: Luxembourg
es: Luxemburgo

source: Malawi
es: Malaui

source: Malaysia
es: Malasia

source: Maldives
es: Maldivas

source: Mali
es: Malí

source: Marshall Islands
es: Islas Marshall

source: Martinique
es: Martinica

source: Mauritius
es: Mauricio

source: Mexico
es: México

source: Micronesia, Federated States Of
es: Micronesia, Estados Federados De

source: Moldova
es: Moldavia

source: Monaco
es: Mónaco

source: Morocco
es: Marruecos

source: Myanmar
es: Birmania

source: Netherlands
es: Países Bajos

source: Netherlands Antilles
es: Antillas Holandesas

source: New Caledonia
es: Nueva Caledonia

source: New Zealand
es: Nueva Zelanda

source: Niger
es: Níger

source: Norfolk Island
es: Isla Norfolk

source: Northern Mariana Islands
es: Islas Marianas del Norte

source: Norway
es: Noruega

source: Oman
es: Omán

source: Pakistan
es: Pakistán

source: Palau
es: Palaos

source: Palestinian Territory, Occupied
es: Territorio Palestino, Ocupado

source: Panama
es: Panamá

source: Papua New Guinea
es: Papúa Nueva Guinea

source: Peru
es: Perú

source: Philippines
es: Filipinas

source: Poland
es: Polonia

source: Qatar
es: Katar

source: Reunion
es: Reunión

source: Romania
es: Rumania

source: Russian Federation
es: Federación Rusa

source: Rwanda
es: Ruanda

source: Saint Barthelemy
es: San Bartolomé

source: Saint Helena
es: Santa Elena

source: Saint Kitts And Nevis
es: San Cristóbal y Nieves

source: Saint Lucia
es: Santa Lucía

source: Saint Martin
es: San Martín

source: Saint Pierre And Miquelon
es: San Pedro y Miquelón

source: Saint Vincent And Grenadines
es: San Vicente y las Granadinas

source: Sao Tome And Principe
es: Santo Tomé y Príncipe

source: Saudi Arabia
es: Arabia Saudita

source: Sierra Leone
es: Sierra Leona

source: Singapore
es: Singapur

source: Slovakia
es: Eslovaquia

source: Slovenia
es: Eslovenia

source: Solomon Islands
es: Islas Salomón

source: South Africa
es: Sudáfrica

source: South Georgia And Sandwich Isl.
es: Islas Georgias del Sur y Sandwich.

source: Spain
es: España

source: Sudan
es: Sudán

source: Suriname
es: Surinam

source: Svalbard And Jan Mayen
es: Svalbard y Jan Mayen

source: Swaziland
es: Suazilandia (Reino de Esuatini)

source: Sweden
es: Suecia

source: Switzerland
es: Suiza

source: Syrian Arab Republic
es: República Árabe Siria

source: Taiwan
es: Taiwán

source: Tajikistan
es: Tayikistán

source: Thailand
es: Tailandia

source: Timor-Leste
es: Timor Oriental

source: Togo
es: Togo (República Togolesa)

source: Trinidad And Tobago
es: Trinidad y Tobago

source: Tunisia
es: Túnez

source: Turkey
es: Turquía

source: Turkmenistan
es: Turkmenistán

source: Turks And Caicos Islands
es: Islas Turcas y Caicos

source: Ukraine
es: Ucrania

source: United Arab Emirates
es: Emiratos Árabes Unidos

source: United Kingdom
es: Reino Unido

source: United States
es: Estados Unidos

source: United States Outlying Islands
es: Islas periféricas de los Estados Unidos

source: Uzbekistan
es: Uzbekistán

source: Virgin Islands, British
es: Islas Vírgenes Británicas

source: Virgin Islands, U.S.
es: Islas Vírgenes, EE. UU.

source: Wallis And Futuna
es: Wallis y Futuna

source: Western Sahara
es: Sahara Occidental

source: Zimbabwe
es: Zimbabue

source: Clear
es: Limpiar

source: Accept
es: Aceptar

source: Cancel
es: Candelar

source: From
es: Desde

source: To
es: A

source: Custom
es: Personalizado

source: W
es: S

source: Su
es: Do

source: Mo
es: Lu

source: Tu
es: Ma

source: We
es: Mi

source: Th
es: Ju

source: Fr
es: Vi

source: January
es: Enero

source: February
es: Febrero

source: March
es: Marzo

source: April
es: Abril

source: May
es: Mayo

source: June
es: Junio

source: July
es: Julio

source: August
es: Agosto

source: September
es: Septiembre

source: October
es: Octubre

source: November
es: Noviembre

source: December
es: Deciembre

source: An error of validation ocurred, contact the admin of the site
es: Ocurrió un error de validación, contacta con el administrador del sitio

source: this is a static and cacheable text
es: esto es un texto estático y cacheable

source: not defined
es: no definido

source: Not connect: Verify Network.
es: No conectado: Verificar Red.

source: Requested page not found.
es: Página solicitada no encontrada.

source: Internal Server Error.
es: Error Interno del Servidor.

source: Requested JSON parse failed.
es: El análisis JSON solicitado falló.

source: Time out error.
es: Error de tiempo de espera.

source: Ajax request aborted.
es: Solicitud de Ajax abortada.

source: Uncaught Error
es: Error no detectado

source: Please check your internet connection, recharge the page and try again later
es: Verifique su conexión a Internet, recargue la página y vuelva a intentarlo más tarde

source: AJAX Response
es: Respuesta AJAX

source: this is a dynamic text, a cache plugin doesn't interfere with this part
es: este es un texto dinámico, un plugin de caché no interfiere con esta parte

source: Executing
es: Ejecutando

source: AJAX successful
es: AJAX exitoso

source: AJAX failed
es: AJAX falló

source: this is a dynamic text, a cache plugin doesn't interfere with the response of the form
es: este es un texto dinámico, un plugin de caché no interfiere con la respuesta del formulario

source: this is a static and cacheable form
es: esto es un formulario estático y cacheable

source: Test form
es: Formulario de prueba

source: The plugin CANNOT BE ACTIVATED if Backend Frontend Template (non Pro version) if is already activated
es: El plugin NO SE PUEDE ACTIVAR si Backend Frontend Template (versión no Pro) está activado también!

source: first deactive it
es: primero desactívelo

source: Test the children page with this link
es: Prueba la pagína hija con este link
