Repository: rszemeti/LiveBidderPLugin
Catalog: backend-frontend-template/languages/bft-internationalization-*.po
Languages: es

source: GROUP BY part of the query, without the FROM tag
es: Parte GROUP BY de la consulta, sin la etiqueta FROM

source: Ids to search for, the indexes will be the column key
es: Ids a buscar, los índices serán la clave de la columna

source: It can be an empty array, an array with manual data, or an automatic array with the ids_required_get_data thanks to
es: Puede ser un array vacío, un array con datos manuales, o un array automático con el ids_required_get_data gracias a

source: Don't search the search string in these columns. The indexes will be the column key
es: No buscar la cadena de búsqueda en las columnas. Los índices serán la clave de la columna

source: Two dimensional array, first dimension is the final column, the second dimension are the colums of the CONCAT, for search the string on merged columns
es: Array bidimensional, primera dimensión es la columna final, la segunda dimensión son las columnas del CONCAT, para buscar la cadena en columnas combinadas

source: Column key of the query
es: Columna clave de la consulta

source: The tables of the columns, with indexes
es: Las tablas de las columnas, con índices

source: The labels of the columns, with indexes of the columns
es: Las etiquetas de las columnas, con índices de las columnas

source: The table uses the column
es: La table usa la columna

source: It writes to the registry the base query
es: Escribe en el log la consulta base

source: A full example of
es: Un ejemplo completo de

source: used in a function
es: usado en una función

source: WordPress functions
es: Funciones WordPress

source: For database manipulation WordPress provide the class
es: Para mainpular la base de datos WordPress proporciona la clase

source: call it inside a function with
es: llámala dentro de una función con

source: Some data manipulation functions of
es: Algunas funciones de manipulación de datos de

source: are
es: son

source: the prefix of the WordPress database, all tables will have this prefix
es: el prefijo de la base de datos de WordPress, todas las tablas tendrán este prefijo

source: do a direct query
es: hace una consulta directa

source: insert a new entry
es: inserta una nueva entrada

source: the function sanitizes the inputs
es: la función sanea los datos

source: the last id inserted
es: último id insertado

source: delete entries that match the array search data
es: eliminar entradas que coincidan con los datos del array de búsqueda

source: update the data in the entries that match the array data
es: actualiza los datos en las entradas que coincidan los datos de array

source: returns a two dimensional array with all the data
es: devuelve un array bidimensional con todo los datos

source: All the info of this class can be found
es: Toda la información de la clase puede encontrarse

source: here
es: aquí

source: Backend Frontend Template functions
es: Funciones de Backend Frontend Template

source: BFT provides additional functions for the programmers that prefer this database access style
es: BFT ofrece funciones adicionales para los programadores que prefieran este estilo de acceso a la base de datos

source: returns a two dimensional array with all the data, the index of each row will be the first column data
es: devuelve un array bidimensional con todos los datos, el índice de cada fila será el dato de la primera columna

source: returns a mono dimensional array, only returns the first column of each row
es: devuelve un array mono dimensional, sólo devuelve la primera columna de cada fila

source: returns a mono dimensional array, the first column data will be the index, the second the data
es: devuelve un array mono dimensional, el dato de la primera columna será el índice, la segunda será el dato

source: returns a string, only return the first column of the first row
es: devuelve una cadena, sólo devuelve la primera columna de la primera línea

source: insert or update multiple data, more explanation below
es: inserta o actualiza varios datos, más explicación debajo

source: insert or update multiple data, then delete the non updated rows, more explanation below
es: inserta o actualiza varios datos, entonces elimina las filas no actualizadas, más información debajo

source: Additional explanations
es: Explicaciones adicionales

source: This function can insert or update a single or several rows, when updating the data can use extra data or only use the data used to insert
es: Esta función puede insertar o actualizar una o varias filas, cuando actualizando los datos puede usar datos extras o sólo usar los datos usados en la inserción

source: array mono dimensional (one insert) or two dimensional (several inserts), the data can have true NULL or string 'NULL'
es: array mono dimensional (un insert) o bidimensional (varias inserciones), los datos pueden tener verdadero NULL o string 'NULL'

source: true if it's needed several inserts
es: true si se necesitan varios inserciones

source: modification datetime, it will use the colum
es: datetime de la modificación, usará la columna

source: if NULL it will use the current time
es: si NULL usará el tiempo actual

source: the data used for an update case, if the array is empty the update will use the
es: los datos usados para el caso de actualización, si el array está vacio la actualización usará la

source: This function uses
es: Esta función usa

source: then it does a delete of the rows not updated
es: entonces hace una eliminación de las filas no actualizadas

source: the column to check
es: la columna a comprobar

source: foreig key
es: clave foránea

source: the id to check on column_where_delete
es: el id a comprobar en column_where_delete

source: This functions is equivalent to delete all the data and insert the new data, the problem is the database abuse, with this the database update all the data
es: Esta función es equivalente a eliminar todos losdatos e insertar los nuevos datos, el problema es el abuso de la base de datos, con esto la base de datos actualiza todos los datos

source: maybe only updates
es: quizás sólo actualiza

source: and then delete the not updated data. Less UPDATE/INSERTS, less DELETES
es: y entonces elimina todos los datos no actualizados. Menos UPDATE/INSERTS, menos DELETES

source: due to how WordPress works the BFT functions are not accesible from create/update/delete database in
es: debido a como WordPress trabbaja las funciones BFT no son accesible desde crear/atualizar/eliminar base de datos en

source: only use the oficial WordPress functions
es: sólo usar las funciones oficiales de WordPress

source: Data sanitization
es: Saneamiento de datos

source: For input sanitization WordPress provide several sanitization functions in the class
es: Para sanear las entradas WordPress proporciona varias funciones de saneamiento en la clase

source: Some sanitization functions of
es: Algunas funciones de saneamiento de

source: sanitize an id
es: sanea un id

source: sanitize a string
es: sanea una cadena

source: sanitize a multiple string
es: sanea multiples cadenas

source: sanitize a full query
es: sanea una consulta completa

source: All the sanitization info can be found
es: Toda la información de saneamiento puede encontrarse

source: For the use of
es: Para el uso de

source: check the info
es: comprueba la información

source: The BFT menu can have child pages, example
es: El menú BFT puede tener páginas hijas, ejemplo

source: isset and true if it's a child
es: añadido y true si es hija

source: isset with the key of the parent if it's a child
es: añadido con la clave del padre si es hija

source: the GET data found within the ids
es: los datos GET encontrados dentro de los ids

source: all combined, this order is the priority for maintain the data
es: todos combinados, este orden es la prioridad para mantener los datos

source: uses the
es: usa la

source: as
es: como

source: without the ids with
es: sin los ids con

source: transformed on a URL GET string
es: transformados en una cadena GET URL

source: on inverse order
es: en orden inverso

source: uses the 'key_final' as 'key'
es: usa la 'key_final' como 'key'

source: it adds
es: añade

source: in the tab link. New if there are an id detected on the GET data
es: en el link de la pestaña. New si hay un id detectado en los datos GET

source: if
es: si

source: doesn't show the first line children tabs of a page
es: no muestra la primera línea de pestañas hijas de una página

source: they are data arrays with
es: son arrays de datos con

source: default empty array
es: array vacío por defecto

source: On the GET data it's needed to put a unique id
es: En los datos GET es necesario poner un id único

source: but on the page/function maybe it's needed like
es: pero en la página/función quizás es necesitado como

source: then use
es: entonces usa

source: Options
es: Opciones

source: throw an error if GET id not found
es: lanza un error si no se ha encontrado un GET id

source: throw an error if GET id not found, for pages with secondary data
es: lanza un error si no se ha encontrado un GET id, para páginas con datos secundarios

source: for pages with secondary data
es: para páginas con datos secundarios

source: if it's a children page there may be automatic ids
es: si es una página hija quizás habrán ids automáticos

source: if a parent have an id or id aux that it's not found on the children page, then the children has the id like an id optional on ids_optional
es: if un padre tiene un id o id auxiliar que no se ha encontrado en la página hija, entonces el hijo tiene el id como un id opcional en ids_optional

source: displays a table with the data of the first child and the form stored in
es: muestra una tabla con los datos del primer hijo y el formulario almacenado en

source: displays a table with the data of the displayed page
es: muestra una tabla con los datos de la página mostrada

source: displays a custom automated form stored in
es: mostrar un formulario personalizado automático almacenado en

source: redirects to the first child page of the current page
es: redirecciona a la primera página hija de la página actual

source: executes admin_permission_check_and_ids_required_check_function_load first
es: ejecuta admin_permission_check_and_ids_required_check_function_load first

source: checks admin premissions and checks required and optionals ids of the page specified on the URL, principal and aux ids type checked, prepared for
es: comprueba los permisos de administración y comprueba los ids requeridos y opcionales especificados en la URL, tipos de ids princpiales y auxilizares seleccionados, preparado para

source: used if needed
es: usaso si es necesario

source: check required and optionals ids of the page specified on the URL, principal and aux ids type checked, prepared for
es: comprueba ids requeridos y opcionales de la página especificada en la URL, tipos de ids principales y auxiliares seleccionados, preparado para

source: donwload a private file
es: descargar archivo privado

source: send a form for automated data manipulation
es: enviar un formulario para manipulación automatizada de datos

source: for select the key to use on
es: para seleccionar la clave a usar en

source: prepared for use with the function
es: preparado parar usarse con la función

source: that function is used on
es: esa función es usada en

source: the full URL of the inside iframe, to use with
es: la URL completa de dentro del iframe, para usar con

source: the slug of the inside iframe, the iframe slug will be changed to
es: el slug de dentro del iframe, el slug del iframe se cambiará a

source: to use with
es: para usar con

source: for use a second full path with the variable
es: para utilizar una segunda ruta completa con la variable

source: parametter
es: parametro

source: generates the variable
es: genera la variable

source: the text of the new entry button, it can be added on the parent or on the child, the priority is on the child data, for use in the function
es: el texto del botón de nueva entrada, puede añadirse en el padre o en el hijo, la prioridad será en los datos del hijo, para usarse con la función

source: and file
es: y archivo

source: It creates the variable
es: Crea la variable

source: and it will be finally used on
es: y será finalmente usado en

source: if new_text is boolean true it will be used the text
es: si new_text is boleano y true usará el texto

source: for the pages with automatic data, used on function
es: para página con datos automáticos, usado en la función

source: It shows the automatic name of the form
es: Muestra el nombre automático del formulario

source: data
es: datos

source: before the data like this
es: antes de los datos como esto

source: Auto name
es: Nombre automático

source: For the auto name is used the
es: Para el nombre automático es usado el

source: only the first ID found
es: sólo el primer ID encontardo

source: but only is used the key_initial (the key_get)
es: pero sólo es usado la key_inicial (la key_get)

source: array with the children pages. A children page can has descent, the maximun of levels is
es: array con las páginas hijas. Una página hija puede tener descendencia, el máximo de niveles es

source: counting the parent page. There is limit because is not recursive, that kills the performance of the server
es: contando la página padre. Hay un límite porque no es recursivo, eso mata el rendimiento del servidor

source: copy the data of a page. Only copy the data not found on the page, neither copy
es: copia los datos de una página.Sólo los datos no encontrado en la página, nunca copia

source: How to start
es: Cómo empezar

source: Use the examples of the beginning, the majority of the options are not needed initially
es: Usa los ejemplos del principio, la mayoría de las opciones no se necesitan inicialmente

source: Except all the
es: Extepto todo el

source: part, that's important, but that is only for children pages. You can see detailed examples on other pages where is needed, because the idea is to have a list page with all the items, and then see a single item on the children
es: parte, eso es importante, pero sólo para páginas hijas. Puedes ver ejemplos detallados en otras páginas donde se necesita, porque la idea es tener una página listado con todas las entradas, y entonces ver una simpre entrada en el hijo

source: In this quick example there are a page that display all the books
es: En este ejemplo rápido hay una página que muestra todos los libros

source: and each item/book links to
es: y cada item/libro enlaza a

source: And because
es: Y porque

source: has
es: tiene

source: the page throw error automatically if a GET required data is not found
es: la página lanza error automáticamente si un dato GET requerido no es encontrado

source: id of the book
es: id del libro

source: in this case
es: en este caso

source: A complex example of nested tabs
es: Un ejemplo complejo de pestañas anidadas

source: This is a part of the menu used on the BFT default menu, more info on
es: Esto es una parte del menú por defecto usado en BFT, más información en

source: database
es: base de datos

source: That generates this menu
es: Eso genera este menú

source: Deinstall the database example on
es: Desinstala la base de datos de ejemplo en

source: You can reinstall the sample database later
es: Puedes reinstalar la base de datos de ejemplo después

source: Change the folder and files of
es: Cambia la carpeta y los arcrhivos de

source: option of the menu
es: opción del menú

source: check the ids required permissions and throw an error if needed
es: comprueba los permisos de los ids requeridos y lanza error si es necesario

source: check the ids and return the data
es: comprueba los ids y devuelve los datos

source: This is an alternative method to retrieve manually the data with
es: Esto es un método alternativo para recuperar manualmente los datos con

source: But this method check if there are ids requiered missing, also can add GET data not define on the ids
es: Pero este método comprueba si hay ids requeridos no encontrados, también añade datos GET no definidos en los ids

source: Function variables
es: Variables de la función

source: What ids to retrieve
es: Qué ids recibir

source: Select if only principal ids or add the optionals
es: Selecciona si sólo ids principales o añadir los opcionales

source: If both
es: Si ambos

source: Read all the GET data on the URL and add the additional options
es: Leer todos los datos GET de la URL y añadir las opciones adicionales

source: GET data will not be added
es: datos GET no se añadirá

source: the GET data key needs to be more than
es: la clave del dato GET necesita tener más de

source: characters
es: caracteres

source: don't return false, instead it returns an empty array if error found
es: no devuelve false, en su lugar devuelve un array vacío si se ha encontrado un error

source: first data if multiple ids
es: primer dato si hay múltiples ids

source: default text
es: texto por defecto

source: If true adds
es: Si true añade

source: in a error throw
es: en un error lanza

source: If triggered on a
es: Si es ejecutado en un

source: select false in a main function
es: selecciona false en una función principal

source: Example of use
es: Ejemplo de uso

source: Wordpress allows you to store data with its settings system, thanks to BFT Pro you can create settings pages with its data fields
es: Wordpress permite almacenar datos con su sistema de ajustes, gracias a BFT Pro puedes crear páginas de ajustes con sus campos de datos

source: Edit your WordPress settings pages on the variable
es: Edita tus páginas de ajustes de WordPress en la variable

source: On each page we describe the fields, and several pages can repeat the same fields
es: En cada página describimos los campos, y varias páginas pueden repetir los mismos campos

source: Design BFT Settings looks like this
es: Diseñar Ajustes BFT se ve así

source: Settings pages
es: Páginas de ajustes

source: empty array
es: array vacío

source: Page field
es: Campo de la página

source: array key
es: clave del array

source: array where we define the data type, if it's multiple, the options for the select, etc.
es: array donde definimos el tipo de datos, si es múltiple, las opciones del select, etc.

source: Input types
es: Tipos de entradas

source: input number, optional
es: input number, opcional

source: Default of
es: Por defeto para

source: alternative
es: alternativo

source: this option calculate the needed steps
es: esta opción calcula los steps/pasos necesarios

source: must have
es: debe tener

source: it stores string wiht checked options
es: guarda cadena con las opciones seleccionadas

source: input text with a calendar, the date will be in MySQL style
es: input text con un calendario, la fecha será estilo MySQL

source: on
es: en

source: is needed
es: es necesario

source: radio buttons, stores string wiht checked options, ej: 'en,es', it requires
es: radio buttons, guarda cadena con las opciones seleeccionadas, ej: 'en,es', requiere

source: store a image on the WordPress Media Library, the data saved on settings is the WordPress ID of the file. Once selected shows the image
es: guarda una imagen en la Biblioteca de Medios de WordPress, el dato al almacenado en los ajustes es el ID de WordPress del archivo. Una vez seleccionado muestra la imagen

source: store a file on the WordPress Media Library, the data saved on settings is the WordPress ID of the file. Once selected shows a download button
es: guarda una archivo en la Biblioteca de Medios de WordPress, el dato al almacenado en los ajustes es el ID de WordPress del archivo. Una vez seleccionado muestraun botón de descarga

source: How the fields are stored
es: Cómo los campos son guardados

source: On the array a field ID is a simple sentence, ej
es: En el array el campo ID es una fase simple, ej

source: but BFT stores it as
es: pero BFT lo almacena como

source: then it will be
es: entonces será

source: That's because WordPress doesn't isolate the settings by plugins, the plugin itself needs to isolate and secure the settings
es: Eso es porque WordPress no aisla los ajustes por plugins, el propio plugin necesita aislar y asegurar los ajustes

source: Knowing this, there are two styles to access for updating and deleting this data by code
es: Sabiendo esto, hay dos estilos de acceso para actualizar y eliminar los datos por código

source: BFT style
es: Estilo BFT

source: new string value
es: nuevo valor de la cadena

source: WordPress style
es: Estilo WordPress

source: use 'update' to create a new entry
es: usa 'update' para crear una nueva entrada

source: An example with all the input types
es: Un ejemplo con todos los tipos de input

source: Thanks for purchase
es: Gracias por su compra

source: with your support it will continue to grow and expand the functionalities and save you more time on the future
es: con tu soporte continuará creciendo y expandiéndo las funcionalidades y te ahorrar más tiempo en el futuro

source: BFT Pro library can be used in any plugin created by the license purchaser as long as it isn't a direct competition of BFT Pro (a plugin/template/library for creating WordPress plugins)
es: La librería BFT puede ser usada en cualquier plugin creado por el comprador de la licencia mientras no sea competencia directa de BFT Pro(un plugin/plantilla/librería para la creación de plugins de WordPress)

source: is a library in continuous growth, it is developed by
es: es una librería en continuo crecimiento, está desarrollada por

source: develop WordPress plugins easily and quickly
es: desarrollar plugins para WordPress de forma fácil y rápida

source: INSTALL database
es: INSTALAR base de datos

source: Needed data is uninstalled
es: Datos necesarios no están instalados

source: DELETE database
es: ELIMINAR base de datos

source: Erase all the Backend Frontend Template data
es: Elimina todos los datos de Backend Frontend Template

source: Abkhazian
es: Abjasio

source: Albanian
es: Albanés

source: Amharic
es: Amárico

source: Arabic
es: Árabe

source: Aragonese
es: Aragonés

source: Armenian
es: Armenio

source: Assamese
es: Asamés

source: Avaric
es: Ávaro

source: Avestan
es: Avéstico

source: Azerbaijani
es: Azerbaiyano

source: Bashkir
es: Bashkirio

source: Basque
es: Euskera

source: Belarusian
es: Bielorruso

source: Bengali
es: Bengalí

source: Bihari languages
es: Idiomas bihari

source: Bosnian
es: Bosnio

source: Breton
es: Bretón

source: Bulgarian
es: Búlgaro

source: Burmese
es: Birmano

source: Catalan
es: Catalán

source: Central Khmer
es: Jemer central

source: Chechen
es: Checheno

source: Chinese
es: Chino

source: Church Slavonic, Old Bulgarian, Old Church Slavonic
es: Eslavo Eclesiástico, Antiguo Búlgaro, Antiguo Eslavo Eclesiástico

source: Chuvash
es: Chuvasio

source: Cornish
es: Córnico

source: Corsican
es: Corso

source: Croatian
es: Croata

source: Czech
es: Checo

source: Danish
es: Danés

source: Divehi, Dhivehi, Maldivian
es: Divehi, Dhivehi, Maldivo

source: Dutch, Flemish
es: Neerlandés, Flamenco

source: Estonian
es: Estonio

source: Faroese
es: Feroés

source: Fijian
es: Fiyiano

source: Finnish
es: Finlandés

source: French
es: Francés

source: Fulah
es: Fulfulde

source: Gaelic, Scottish Gaelic
es: Gaélico, Gaélico Escocés

source: Galician
es: Gallego

source: Georgian
es: Georgiano

source: German
es: Alemán

source: Greek (Modern)
es: Griego (Moderno)

source: Greenlandic, Kalaallisut
es: Groenlandés, Kalaallisut

source: Guarani
es: Guaraní

source: Gujarati
es: Guyaratí

source: Haitian, Haitian Creole
es: Haitiano, Criollo Haitiano

source: Hebrew
es: Hebreo

source: Hungarian
es: Húngaro

source: Icelandic
es: Islandés

source: Indonesian
es: Indonesio
